# константы для моделей:


# Максимальное время выполнения
TIME_COMPLATE: int = 120


NULLABLE = {'blank': True,
            'null': True}

# периодичность выполнения привычки
FREQUENCY = {'1': '1 раз в неделю',
             '2': '2 раз в неделю',
             '3': '3 раз в неделю',
             '4': '4 раз в неделю',
             '5': '5 раз в неделю',
             '6': '6 раз в неделю',
             '7': 'каждый день'}

# место выполнения привычки
PLACE = {'HOME': 'дома',
         'STUDY': 'на учебе',
         'WORK': 'на работе',
         'STREET': 'на улице',
         'OTHER': 'в другом месте'}
